ЦентраАдминистрированияСервер/src/Catalogs/ЗадачиИсполнителя/ЗадачиИсполнителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачиИсполнителя</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <comment>Дата и время фактического выполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКИсполнению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешнейЗадачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетЗадачи</name>
    <type>
      <types>EnumRef.ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГруппаПодзадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/Enums/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадач</name>
  <enumValues>
    <name>Открыта</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессе</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

ЦентраАдминистрированияСервер/src/Catalogs/ЗадачиИсполнителя/Forms/ФормаЗадачи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда 
		ОпределитьГруппуЗадачи();
	КонецЕсли;
	
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеОписанияЗадачи = ЗадачаОбъект.ХранилищеОписаниеЗадачи.Получить();
	
	Если ТипЗнч(ДанныеОписанияЗадачи) = Тип("ФорматированныйДокумент") Тогда
		ОписаниеЗадачи = ДанныеОписанияЗадачи;
	ИначеЕсли ТипЗнч(ДанныеОписанияЗадачи) = Тип("Строка") Тогда
		ОписаниеЗадачи.Добавить(ДанныеОписанияЗадачи, ТипЭлементаФорматированногоДокумента.Текст);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаСоздания) Тогда
		Объект.ДатаСоздания = ТекущаяДата();
		Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.Открыта;
		Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		Объект.СрокИсполнения = ТекущаяДата()+86400;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ХранилищеОписаниеЗадачи = Новый ХранилищеЗначения(ОписаниеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗадачиПриИзменении(Элемент)
	
	Если Объект.СтатусЗадачи = ПредопределенноеЗначение("Перечисление.СтатусыЗадач.ВПроцессе") Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.ДатаПринятияКИсполнению) Тогда
			Объект.ДатаПринятияКИсполнению = ТекущаяДата();
		КонецЕсли;
		Объект.Выполнена = Ложь;
	КонецЕсли;
	
	Если Объект.СтатусЗадачи = ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Закрыта") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаИсполнения) Тогда
			Объект.ДатаИсполнения = ТекущаяДата();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаПринятияКИсполнению) Тогда
			Объект.ДатаПринятияКИсполнению = ТекущаяДата();
		КонецЕсли;
		Объект.Выполнена = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Объект.ДатаСоздания = ТекущаяДата();
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполненаВыполнить(Команда)

	Объект.СтатусЗадачи = ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Закрыта"); 
	
	СтатусЗадачиПриИзменении("");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоГруппаПодзадачПриИзменении(Элемент)
	
	//Элементы.СтатусЗадачи.Видимость = Объект.ЭтоГруппаПодзадач;
	//Элементы.Инициатор.Видимость = Объект.ЭтоГруппаПодзадач;
	//Элементы.Пользователь.Видимость = Объект.ЭтоГруппаПодзадач;
	//Элементы.Дата.Видимость = Объект.ЭтоГруппаПодзадач;
	//Элементы.ДатаПринятияКИсполнению.Видимость = Объект.ЭтоГруппаПодзадач;
	//Элементы.СтатусЗадачи.Видимость = Объект.ЭтоГруппаПодзадач;
	//Элементы.СтатусЗадачи.Видимость = Объект.ЭтоГруппаПодзадач;
	
КонецПроцедуры



#КонецОбласти

&НаСервере
Процедура ОпределитьГруппуЗадачи()
	
	Если НЕ Объект.Родитель.ЭтоГруппаПодзадач Тогда
		Пока Объект.Родитель <> Справочники.ЗадачиИсполнителя.ПустаяСсылка() 
			И Объект.Родитель.ЭтоГруппаПодзадач = Ложь цикл
				Объект.Родитель = Объект.Родитель.Родитель;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура РодительНачалоВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РодительНачалоВыбораНаСервере();
КонецПроцедуры
